In [300]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [301]:
app_df = pd.read_csv("application_record.csv")

In [302]:
app_df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [303]:
app_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [304]:
app_df.isna().sum()

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
FLAG_MOBIL                  0
FLAG_WORK_PHONE             0
FLAG_PHONE                  0
FLAG_EMAIL                  0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

In [305]:
app_df_null = app_df.dropna(axis=0)
app_df_null.isnull().sum()

ID                     0
CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
DAYS_BIRTH             0
DAYS_EMPLOYED          0
FLAG_MOBIL             0
FLAG_WORK_PHONE        0
FLAG_PHONE             0
FLAG_EMAIL             0
OCCUPATION_TYPE        0
CNT_FAM_MEMBERS        0
dtype: int64

In [306]:
app_df_drop = app_df_null.drop(['DAYS_BIRTH','DAYS_EMPLOYED','FLAG_MOBIL','FLAG_PHONE','FLAG_WORK_PHONE','FLAG_EMAIL','OCCUPATION_TYPE'],axis=1)
app_df_drop.isnull().sum()

ID                     0
CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
CNT_FAM_MEMBERS        0
dtype: int64

In [307]:
app_df_drop.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1.0
5,5008810,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1.0
6,5008811,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,1.0

In [308]:
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()

In [309]:
cat_data = ['CODE_GENDER','FLAG_OWN_CAR','FLAG_OWN_REALTY','NAME_INCOME_TYPE','NAME_EDUCATION_TYPE','NAME_FAMILY_STATUS','NAME_HOUSING_TYPE']

In [310]:
app_df_drop[cat_data] = app_df_drop[cat_data].apply(lb.fit_transform)

In [311]:
app_df_drop

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS
2,5008806,1,1,1,0,112500.0,4,4,1,1,2.0
3,5008808,0,0,1,0,270000.0,0,4,3,1,1.0
4,5008809,0,0,1,0,270000.0,0,4,3,1,1.0
5,5008810,0,0,1,0,270000.0,0,4,3,1,1.0
6,5008811,0,0,1,0,270000.0,0,4,3,1,1.0
...,...,...,...,...,...,...,...,...,...,...,...
438541,6837707,1,0,1,0,202500.0,4,1,0,1,2.0
438548,6839936,1,1,1,1,135000.0,4,4,1,1,3.0
438553,6840222,0,0,0,0,103500.0,4,4,3,1,1.0
438554,6841878,0,0,0,0,54000.0,0,1,3,5,1.0
438556,6842885,0,0,1,0,121500.0,4,4,1,1,2.0

In [312]:
#Checking Outliers & remove Outliers
high_bound = app_df_drop['CNT_CHILDREN'].quantile(0.999)
print('high_bound :', high_bound)
low_bound = app_df_drop['CNT_CHILDREN'].quantile(0.001)
print('low_bound :', low_bound)

high_bound : 4.0
low_bound : 0.0

In [313]:
app_df_drop = app_df_drop[(app_df_drop['CNT_CHILDREN']>=low_bound) & (app_df_drop['CNT_CHILDREN']<=high_bound)]

In [314]:
high_bound = app_df_drop['AMT_INCOME_TOTAL'].quantile(0.999)
print('high_bound :', high_bound)
low_bound = app_df_drop['AMT_INCOME_TOTAL'].quantile(0.001)
print('low_bound :', low_bound)

high_bound : 1125000.0
low_bound : 42750.0

In [315]:
app_df_drop = app_df_drop[(app_df_drop['AMT_INCOME_TOTAL']>=low_bound) & (app_df_drop['AMT_INCOME_TOTAL']<=high_bound)]

In [316]:
high_bound = app_df_drop['CNT_FAM_MEMBERS'].quantile(0.999)
print('high_bound :', high_bound)
low_bound = app_df_drop['CNT_FAM_MEMBERS'].quantile(0.001)
print('low_bound :', low_bound)

high_bound : 6.0
low_bound : 1.0

In [317]:
app_df_drop = app_df_drop[(app_df_drop['CNT_FAM_MEMBERS']>=low_bound) & (app_df_drop['CNT_FAM_MEMBERS']<=high_bound)]

In [318]:
credit_df = pd.read_csv("credit_record.csv")

In [319]:
credit_df.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [320]:
credit_df.isnull().sum()

ID                0
MONTHS_BALANCE    0
STATUS            0
dtype: int64

In [321]:
# categorizing 'STATUS' column to binary classification   0 : Good Client and 1 : bad client
credit_df['STATUS'].replace(['C', 'X'],0, inplace=True)

In [322]:
credit_df['STATUS'].replace(['2','3','4','5'],1, inplace=True)

In [323]:
credit_df['STATUS'] = credit_df['STATUS'].astype('int')

In [324]:
credit_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   MONTHS_BALANCE  1048575 non-null  int64
 2   STATUS          1048575 non-null  int32
dtypes: int32(1), int64(2)
memory usage: 20.0 MB

In [325]:
credit_df_trans = credit_df.groupby('ID').agg(max).reset_index()
credit_df_trans.drop('MONTHS_BALANCE', axis=1, inplace=True)
credit_df_trans.head()

        ID  STATUS
0  5001711       0
1  5001712       0
2  5001713       0
3  5001714       0
4  5001715       0

In [326]:
#adding to data
final_df = pd.merge(app_df_drop, credit_df_trans, on='ID', how='inner')
final_df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS,STATUS
0,5008806,1,1,1,0,112500.0,4,4,1,1,2.0,0
1,5008808,0,0,1,0,270000.0,0,4,3,1,1.0,0
2,5008809,0,0,1,0,270000.0,0,4,3,1,1.0,0
3,5008810,0,0,1,0,270000.0,0,4,3,1,1.0,0
4,5008811,0,0,1,0,270000.0,0,4,3,1,1.0,0

In [327]:
final_df.shape

(25060, 12)

In [328]:
# dropping 'ID' column as it is having only unique values (not required for ML Model)
final_df.drop('ID', axis=1, inplace=True)

In [329]:
# checking if there are still duplicate rows in Final Dataframe
len(final_df) - len(final_df.drop_duplicates())

19986

In [330]:
# Dropping duplicate records
final_df = final_df.drop_duplicates()
final_df.reset_index(drop=True ,inplace=True)

In [331]:
final_df.shape

(5074, 11)

In [332]:
final_df.isnull().sum()

CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
CNT_FAM_MEMBERS        0
STATUS                 0
dtype: int64

In [333]:
final_df.head()

,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS,STATUS
0,1,1,1,0,112500.0,4,4,1,1,2.0,0
1,0,0,1,0,270000.0,0,4,3,1,1.0,0
2,1,1,1,0,270000.0,4,1,1,1,2.0,0
3,1,1,1,0,135000.0,0,4,1,1,2.0,0
4,0,1,0,0,130500.0,4,2,1,1,2.0,1

In [334]:
#Dependent & Independant Variable
X = final_df.iloc[:,0:-1]
X

,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS
0,1,1,1,0,112500.0,4,4,1,1,2.0
1,0,0,1,0,270000.0,0,4,3,1,1.0
2,1,1,1,0,270000.0,4,1,1,1,2.0
3,1,1,1,0,135000.0,0,4,1,1,2.0
4,0,1,0,0,130500.0,4,2,1,1,2.0
...,...,...,...,...,...,...,...,...,...,...
5069,0,0,1,1,108000.0,4,4,3,1,1.0
5070,0,0,0,0,180000.0,1,4,0,2,2.0
5071,0,1,1,0,130500.0,4,4,1,1,2.0
5072,0,0,1,0,157500.0,1,1,1,1,2.0
5073,1,0,1,0,112500.0,4,4,3,4,1.0

In [335]:
y = final_df.iloc[:,-1]
y

0       0
1       0
2       0
3       0
4       1
       ..
5069    1
5070    1
5071    1
5072    1
5073    1
Name: STATUS, Length: 5074, dtype: int32

In [336]:
#Feature Scaling
# from sklearn.preprocessing import StandardScaler
# sc = StandardScaler()
# sc.fit_transform(X)
from sklearn.preprocessing import MinMaxScaler
nm = MinMaxScaler()
nm.fit_transform(X)

array([[1.  , 1.  , 1.  , ..., 0.25, 0.2 , 0.2 ],
       [0.  , 0.  , 1.  , ..., 0.75, 0.2 , 0.  ],
       [1.  , 1.  , 1.  , ..., 0.25, 0.2 , 0.2 ],
       ...,
       [0.  , 1.  , 1.  , ..., 0.25, 0.2 , 0.2 ],
       [0.  , 0.  , 1.  , ..., 0.25, 0.2 , 0.2 ],
       [1.  , 0.  , 1.  , ..., 0.75, 0.8 , 0.  ]])

In [337]:
#train test split
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(nm.fit_transform(X),y,test_size=0.2,random_state = 10)

In [338]:
#Using Logistic Regression
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report, accuracy_score, confusion_matrix

lr = LogisticRegression()
lr.fit(X_train, y_train)

print('Logistic Model Accuracy : ', lr.score(X_test, y_test)*100, '%')

prediction = lr.predict(X_test)
print('\nConfusion matrix :')
print(confusion_matrix(y_test, prediction))
      
print('\nClassification report:')      
print(classification_report(y_test, prediction))

Logistic Model Accuracy :  71.6256157635468 %

Confusion matrix :
[[727   0]
 [288   0]]

Classification report:
              precision    recall  f1-score   support

           0       0.72      1.00      0.83       727
           1       0.00      0.00      0.00       288

    accuracy                           0.72      1015
   macro avg       0.36      0.50      0.42      1015
weighted avg       0.51      0.72      0.60      1015

C:\Users\rohit\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1245: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
C:\Users\rohit\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1245: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
C:\Users\rohit\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1245: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [348]:
# using SVM
from sklearn.svm import SVC

svc_model = SVC()

svc_model.fit(X_train, y_train)

print('Support Vector Classifier Accuracy : ', svc_model.score(X_test, y_test)*100, '%')

prediction = svc_model.predict(X_test)
print('\nConfusion matrix :')
print(confusion_matrix(y_test, prediction))
      
print('\nClassification report:')      
print(classification_report(y_test, prediction))

Support Vector Classifier Accuracy :  71.6256157635468 %

Confusion matrix :
[[727   0]
 [288   0]]

Classification report:
              precision    recall  f1-score   support

           0       0.72      1.00      0.83       727
           1       0.00      0.00      0.00       288

    accuracy                           0.72      1015
   macro avg       0.36      0.50      0.42      1015
weighted avg       0.51      0.72      0.60      1015

C:\Users\rohit\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1245: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
C:\Users\rohit\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1245: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
C:\Users\rohit\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1245: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [350]:
print("Prediction table:")
a=svc_model.predict(X_test)
b=y_test
z=list(enumerate(a))
z=[x[0] for x in z]
table={'Index':z,'Predicted value':a,'Real value':b}
nf=pd.DataFrame(table)
nf.style.hide_index()
nf.head(75)

# nf['Predicted value'].unique()

Prediction table:

      Index  Predicted value  Real value
346       0                0           0
1370      1                0           0
3995      2                0           1
1910      3                0           0
4982      4                0           1
...     ...              ...         ...
1789     70                0           0
1638     71                0           0
54       72                0           0
484      73                0           0
5067     74                0           1

[75 rows x 3 columns]